# RbsDistributionsysNumwiresParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDistributionsysNumwiresParam Property
ParameterTypeId Class See Also
---
"Wires"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDistributionsysNumwiresParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDistributionsysNumwiresParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDistributionsysNumwiresParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace